rongshuxia/rt-thread_stm32f407/board/board.h
/*
 * Copyright (c) 2006-2021, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2018-11-5      SummerGift   first version
 */

#ifndef __BOARD_H__
#define __BOARD_H__

#include <rtthread.h>
#include <stm32f4xx.h>
#include "drv_common.h"
#include "drv_gpio.h"

#ifdef __cplusplus
extern "C" {
#endif

#define STM32_SRAM_SIZE        (128)
#define STM32_SRAM_END         (0x20000000 + STM32_SRAM_SIZE * 1024)

#define STM32_FLASH_START_ADRESS     ((uint32_t)0x08000000)
#define STM32_FLASH_SIZE             (1024 * 1024)
#define STM32_FLASH_END_ADDRESS      ((uint32_t)(STM32_FLASH_START_ADRESS + STM32_FLASH_SIZE))

#ifdef BSP_USING_IS62WV51216_HEAP
#include "is62wv51216.h"
#ifndef IS62WV51216_HEAP_SIZE
#define IS62WV51216_HEAP_SIZE        IS62WV51216_SIZE
#endif
#define HEAP_BEGIN                   ((void *)IS62WV51216_BASE_ADDR)
#define HEAP_END                     ((void *)(IS62WV51216_BASE_ADDR + IS62WV51216_HEAP_SIZE))
#else
#if defined(__CC_ARM) || defined(__CLANG_ARM)
extern int Image$$RW_IRAM1$$ZI$$Limit;
#define HEAP_BEGIN      ((void *)&Image$$RW_IRAM1$$ZI$$Limit)
#elif __ICCARM__
#pragma section="CSTACK"
#define HEAP_BEGIN      (__segment_end("CSTACK"))
#else
extern int __bss_end;
#define HEAP_BEGIN      ((void *)&__bss_end)
#endif

#define HEAP_END        STM32_SRAM_END
#endif /* BSP_USING_IS62WV51216_HEAP */

void SystemClock_Config(void);

#ifdef __cplusplus
}
#endif

#endif

